# EndPoly

## Description
Procedure EndPoly completes the definition of a polygon or polyline object within a Vectorworks document. On calling EndPoly, the object is created in the document from the preceding vertex creation calls.&lt;BR&gt;

```pascal
PROCEDURE EndPoly;
```

```python

def vs.EndPoly():
    return None
```

## Version
Availability: from MiniCAD
## Category
* Objects - Polys